In [1]:
import pandas as pd

In [3]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [4]:
def f(column):
    return column.split('-')[0]

하나의 컬럼을 받았을 때 전체 값에서 - 로 구분하여 리스트로 만든다음에 0번 인덱스를 반환하라는 것이다.

In [5]:
df['year'] = df['yyyy-mm-dd'].apply(f)

In [6]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [7]:
def get_age(year, current_year):
    return current_year - int(year)

In [8]:
df['age'] = df['year'].apply(get_age, current_year = 2022)

In [9]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   22
1  2002-09-24  2002   20
2  2005-12-20  2005   17

In [10]:
def introduce(age, pre, suf):
    return pre + str(age) + suf

In [14]:
df['introduce'] = df['age'].apply(introduce,pre='I am', suf='years old')

In [15]:
df

   yyyy-mm-dd  year  age        introduce
0  2000-06-27  2000   22  I am22years old
1  2002-09-24  2002   20  I am20years old
2  2005-12-20  2005   17  I am17years old